# فرض کنید شما به عنوان یک کاربر می خواهید کد پستی خود را وارد کنید.
# برنامه ای بنویسید که بررسی کند کد پستی وارد شده معتبر است یا خیر.
# یک کد پستی معتبر باید 5 رقم داشته باشد و تمام آنها عدد باشند.


#توضیحات بیشتر در این لینک
#https://docs.google.com/document/d/1jsimQZFrpsYPS1R0KTFHssiRXqkbsfssq75XUEIyUDQ/edit?usp=drive_link
# ※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※         
Zip=input("zipcode: ")  # دریافت کد پستی از کاربر

if len(Zip)==5 and Zip.isdigit()==True:  # بررسی طول کد پستی و اینکه آیا فقط شامل اعداد است یا خیر
    print("yes")  # چاپ "بله" اگر کد پستی معتبر باشد
else:
    print("no")  # چاپ "خیر" اگر کد پستی معتبر نباشد

