# صورت سوال:
# دو رشته به نام Str1 و Str2 از کاربر گرفته می‌شود.
# سپس با استفاده از یک تابع به نام ch_word بررسی می‌شود که آیا این دو رشته با یکدیگر برابر هستند یا خیر.
# در این بررسی، دو حالت وجود دارد:

# حالت حساس: در این حالت، به بزرگی و کوچکی حروف توجه می‌شود.
# حالت غیرحساس: در این حالت، به بزرگی و کوچکی حروف توجه نمی‌شود و هر دو رشته به حروف کوچک تبدیل می‌شوند.
# بر اساس این دو حالت، تابع ch_word خروجی‌های زیر را نمایش می‌دهد:

# اگر دو رشته در هر دو حالت (حساس و غیرحساس) برابر باشند، عبارت "ok" چاپ می‌شود.
# اگر دو رشته فقط در حالت غیرحساس برابر باشند، عبارت "ok" چاپ می‌شود.
# در غیر این صورت، عبارت "error" چاپ می‌شود.



#توضیحات بیشتر در این لینک
#https://docs.google.com/document/d/1wRwaxecDrp7fjABCwM8nRWB83ir6WEXTSC-W_cHKITo/edit?usp=sharing
# ※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※         
Str1 = input("string1: ")  # دریافت رشته اول از کاربر
Str2 = input("string2: ")  # دریافت رشته دوم از کاربر

def ch_word(w1, w2, d=False):  # تعریف تابع `ch_word` با سه پارامتر:
    # `w1` و `w2` رشته‌های ورودی، و `d` یک مقدار پیش‌فرض `False` (برای حالت غیرحساس)

    if d == True:  # بررسی حالت حساس (d = True)
        if w1 == w2:  # مقایسه دو رشته با در نظر گرفتن بزرگی و کوچکی حروف
            print("ok")  # چاپ "ok" در صورت برابری کامل
        else:
            print("error")  # چاپ "error" در صورت عدم برابری کامل

    elif d == False:  # بررسی حالت غیرحساس (d = False)
        w1 = w1.lower()  # تبدیل هر دو رشته به حروف کوچک
        w2 = w2.lower()

        if w1 == w2:  # مقایسه دو رشته با حروف کوچک
            print("ok")  # چاپ "ok" در صورت برابری با حروف کوچک
        else:
            print("error")  # چاپ "error" در صورت عدم برابری با حروف کوچک

ch_word(Str1, Str2)  # اجرای تابع `ch_word` با رشته‌های ورودی Str1 و Str2

