# صورت سوال
# فرض کنید شما در یک فروشگاه هستید و می خواهید شماره کارت بانکی خود را برای پرداخت وجه وارد کنید.
# به دلایل امنیتی، تمایل ندارید تمام شماره کارت خود را به فروشنده نشان دهید.

# سوال:
# کدی بنویسید که با دریافت شماره کارت از کاربر، 4 رقم آخر آن را با ستاره نمایش دهد و باقی ارقام را پنهان کند.



#توضیحات بیشتر در این لینک
#https://docs.google.com/document/d/1s79hVa8EeXJUM26wRkSZ2enS5ZMz-7YH3UB30DrRV7k/edit?usp=sharing
# ※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※         
card_num = input("شماره کارت خود را وارد کنید: ")  # دریافت شماره کارت از کاربر
print(card_num[:-4] + "****")  # چاپ 4 رقم آخر کارت با ستاره و پنهان کردن باقی ارقام
