# یافتن دومین عدد کوچک‌تر در میان اعداد ورودی توسط کاربر
# در این برنامه، از کاربر خواسته می‌شود تا اعداد صحیح را به صورت جداگانه وارد کند.
# برنامه تا زمانی که کاربر عبارت "end" را وارد کند، به خواندن اعداد ادامه می‌دهد.
# در طول این فرآیند، برنامه دو متغیر Temp1 و Temp2 را برای ذخیره اولین و دومین عدد کوچک‌تر  نگهداری می‌کند.
# در نهایت، برنامه عدد ذخیره شده در متغیر Temp2 را که دومین عدد کوچک‌تر  می‌باشد، چاپ می‌کند.



#توضیحات بیشتر در این لینک
#https://docs.google.com/document/d/1PrAqTFXQA9Bf4l2WXaF-2fe6Ndma466POld-SOrPsF4/edit?usp=drive_link
# ※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※         
Temp1 = 0  # متغیری برای ذخیره اولین عدد کوچک‌تر
Temp2 = 0  # متغیری برای ذخیره دومین عدد کوچک‌تر

Data = input("add new int: ")  # خواندن اولین عدد از کاربر

while Data != "end":  # حلقه while تا زمانی که کاربر "end" را وارد کند
    if int(Data) < Temp1:  # بررسی اینکه آیا عدد ورودی جدید کوچکتر از Temp1 است یا خیر
        Temp2 = Temp1  # جابجایی مقادیر Temp1 و Temp2
        Temp1 = int(Data)  # ذخیره عدد جدید به عنوان Temp1
    elif int(Data) < Temp2:  # بررسی اینکه آیا عدد ورودی جدید کوچکتر از Temp2 است یا خیر
        Temp2 = int(Data)  # ذخیره عدد جدید به عنوان Temp2
    Data = input("add new int and type 'end' to calc: ")  # خواندن عدد بعدی از کاربر

print(Temp2)  # چاپ دومین عدد کوچک‌تر
