# عنوان: مرتب سازی سه عدد با استفاده از دستورات شرطی

# مفاهیم:

# دریافت ورودی از کاربر
# متغیرها
# عملگرهای مقایسه
# دستورات شرطی (if)
# جابجایی مقادیر
# دستورالعمل:

# سه عدد را از کاربر به عنوان ورودی دریافت کنید.
# از دستورات شرطی (if) برای مقایسه اعداد و جابجایی آنها به ترتیب نزولی استفاده کنید.
# سه عدد مرتب شده را چاپ کنید.

# توضیحات بیشتر در این داکیومنت
#https://docs.google.com/document/d/1kc3XkbugUwrLj-VA4u6Fx0IbR7LaIoQuqMlXsOvdMSM/edit?usp=sharing
# ※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※
# دریافت عدد اول از کاربر
Num1 = int(input("عدد اول را وارد کنید: "))

# دریافت عدد دوم از کاربر
Num2 = int(input("عدد دوم را وارد کنید: "))

# دریافت عدد سوم از کاربر
Num3 = int(input("عدد سوم را وارد کنید: "))

# متغیری برای ذخیره موقت
Temp = 0

# بررسی اینکه آیا عدد اول بزرگتر از عدد دوم است یا خیر
if Num1 > Num2:
    # جابجایی مقادیر عدد اول و دوم
    Temp = Num2
    Num2 = Num1
    Num1 = Temp

# بررسی اینکه آیا عدد اول بزرگتر از عدد سوم است یا خیر
if Num1 > Num3:
    # جابجایی مقادیر عدد اول و سوم
    Temp = Num1
    Num1 = Num3
    Num3 = Temp

# بررسی اینکه آیا عدد دوم بزرگتر از عدد سوم است یا خیر
if Num2 > Num3:
    # جابجایی مقادیر عدد دوم و سوم
    Temp = Num2
    Num3 = Num2
    Num2 = Temp

# چاپ اعداد مرتب شده
print(Num1, Num2, Num3)


