# *یک ماشین حساب ساده بسازید که دو عدد را از کاربر دریافت کند و بر اساس عملگر انتخابی (+، -، ، /)
# عملیات را انجام دهد. در صورت تلاش برای تقسیم عدد کوچکتر بر عدد بزرگتر، پیام خطا نمایش دهد.

# جزئیات بیشتر:

# از توابع input برای دریافت دو عدد و عملگر از کاربر استفاده کنید.
# از دستورات شرطی if و elif برای بررسی عملگر انتخابی و انجام عملیات مربوطه استفاده کنید.
# از توابع int و float برای تبدیل ورودی کاربر به نوع داده صحیح یا اعشاری در صورت نیاز استفاده کنید.
# در صورت بروز خطا (تقسیم بر صفر یا تقسیم عدد کوچکتر بر عدد بزرگتر)، پیام خطای مناسب را نمایش دهید.
# خروجی نهایی را با استفاده از تابع print نمایش دهید.


# توضیحات بیشتر در این داکیومنت
#https://docs.google.com/document/d/14Ist2oEU-69x--Ed8laYMfr2fjcULck4sskmcChIjIY/edit?usp=sharing
# ※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※
Num1 = int(input("Enter number 1: "))  # دریافت عدد اول از کاربر و تبدیل آن به عدد صحیح
Num2 = int(input("Enter number 2: "))  # دریافت عدد دوم از کاربر و تبدیل آن به عدد صحیح
Operator = input("Enter operator: ")  # دریافت عملگر از کاربر (مثلا +، -، *، /)
result = 0  # متغیری برای ذخیره نتیجه

if Operator == "+":  # بررسی اگر عملگر برابر با "+" باشد
    result = Num1 + Num2  # جمع دو عدد و ذخیره نتیجه در متغیر result
elif Operator == "-":  # بررسی اگر عملگر برابر با "-" باشد
    result = Num1 - Num2  # تفریق دو عدد و ذخیره نتیجه در متغیر result
elif Operator == "*":  # بررسی اگر عملگر برابر با "*" باشد
    result = Num1 * Num2  # ضرب دو عدد و ذخیره نتیجه در متغیر result
elif Operator == "/":  # بررسی اگر عملگر برابر با "/" باشد
    if Num2 > Num1:  # بررسی اگر عدد دوم بزرگتر از عدد اول باشد
        print("Error")  # چاپ پیام خطا
        Num1 = int(input("Enter number 1: "))  # دریافت مجدد عدد اول از کاربر
        Num2 = int(input("Enter number 2: "))  # دریافت مجدد عدد دوم از کاربر
    result = Num1 / Num2  # تقسیم دو عدد و ذخیره نتیجه در متغیر result

print(result)  # چاپ نتیجه نهایی

